# Ultralytics  AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 80 # 类别数 = 80，对应 COCO 数据集
depth_multiple: 0.33 # 控制「网络有多深」，在代码里，每个 C3 的重复次数 number 会乘以这个系数再取整。
width_multiple: 0.50 # 控制「每层的通道数有多宽」，通道数（如 64, 128, 256）都会乘以 0.5 再取整到 8 的倍数。
anchors: # 每一行对应一个特征层（输出尺度）上的 3 个 anchor
  - [10, 13, 16, 30, 33, 23] # P3/8 → stride=8 的 P3（小目标）
  - [30, 61, 62, 45, 59, 119] # P4/16 → stride=16 的 P4（中目标）
  - [116, 90, 156, 198, 373, 326] # P5/32 → stride=32 的 P5（大目标）

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  # [来源, 重复次数, 具体模块, 参数]
  [
    #640×640×3
    [-1, 1, Conv, [64, 6, 2, 2]],                 # 0  P1 (stride 2)
    #320×320×32
    [-1, 1, Conv, [128, 3, 2]],                   # 1  P2 (stride 4)    
    #160×160×64
    [-1, 3, C3, [128]],                           # 2  强化中低级特征 
    #160×160×64
    [-1, 1, Conv, [256, 3, 2]],                   # 3  P3 (stride 8)，后面给“小目标”用 
    #80×80×128
    [-1, 6, C3, [256]],                           # 4           
    #80×80×128
    [-1, 1, Conv, [512, 3, 2]],                   # 5  P4 (stride 16)，中目标 
    #40×40×256
    [-1, 9, C3, [512]],                           # 6           
    #40×40×256
    [-1, 1, Conv, [1024, 3, 2]],                  # 7  P5 (stride 32)，大目标   
    #20×20×512v
    [-1, 3, C3, [1024]],                          # 8
    #20×20×512
    [-1, 1, SPPF, [1024, 5]],                     # 9  大感受野特征 P5_SPPF
    #20×20×512
  ]

# YOLOv5 v6.0 head
head: [
  #FPN
    #20×20×512
    [-1, 1, Conv, [512, 1, 1]],                   # 10
    #20×20×256
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],   # 11
    #40×40×256 + 40×40×256
    [[-1, 6], 1, Concat, [1]],                    # 12 cat backbone P4
    #40×40×512
    [-1, 3, C3, [512, False]],                    # 13
    #40×40×256

    #40×40×256
    [-1, 1, Conv, [256, 1, 1]],                   # 14
    #40×40×128
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],   # 15
    #80×80×128 + 80×80×128
    [[-1, 4], 1, Concat, [1]],                    # 16 cat backbone P3
    #80×80×256
    [-1, 3, C3, [256, False]],                    # 17 (P3/8-small)    小目标
    #80×80×128

  #PAN
    #80×80×128
    [-1, 1, Conv, [256, 3, 2]],                   # 18
    #40×40×128
    [[-1, 14], 1, Concat, [1]],                   # 19 cat head P4
    #40×40×256
    [-1, 3, C3, [512, False]],                    # 20 (P4/16-medium)  中目标
    #40×40×256

    #40×40×256
    [-1, 1, Conv, [512, 3, 2]],                   # 21
    #20×20×256
    [[-1, 10], 1, Concat, [1]],                   # 22 cat head P5
    #20×20×512
    [-1, 3, C3, [1024, False]],                   # 23 (P5/32-large)   大目标
    #20×20×512

    #P3_head: [bs, 128, 80, 80]
    #P4_head: [bs, 256, 40, 40]
    #P5_head: [bs, 512, 20, 20]
    [[17, 20, 23], 1, Detect, [nc, anchors]],     # Detect(P3, P4, P5)
    #P3_pred: [bs, 3, 80, 80, 5+80]
    #P4_pred: [bs, 3, 40, 40, 5+80]
    #P5_pred: [bs, 3, 20, 20, 5+80]
  ]

